---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SitePhasesDontOverlap
source: html/e6ae6920-d59d-cdce-a373-5cdbdcf8f99d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SitePhasesDontOverlap Property

The phases of the two surfaces you are merging do not overlap. You can continue the operation, or cancel it and select a different pair of surfaces.

## Syntax (C#)
```csharp
public static FailureDefinitionId SitePhasesDontOverlap { get; }
```